{
  "branchImage": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQ2zKjA4sJxMRzGJH2tflTzGg8E5Bv2w8MZkg&s",
  "nextBranchFile": "cursed_crown/cursed_crown_05.json",
  "branches": [
    {
      "branch_id": 10,
      "text": "The ghost of the Wraith King rises from the throne, his voice echoing like thunder wrapped in silk. *You carry my legacy,* he says. *But are you worthy to bear it?* The chamber trembles, and a dark wind sweeps through the ruins.",
      "responses": [
        {
          "response": "Challenge the spirit to combat — prove your strength.",
          "branch_id": 11,
          "effects": { "energy": -15, "strength": 10, "health": -10, "gold": 0 }
        },
        {
          "response": "Bow and offer your loyalty, hoping to appease him.",
          "branch_id": 12,
          "effects": { "energy": -5, "strength": 0, "health": 0, "gold": 0 }
        },
        {
          "response": "Attempt to bind his spirit using the crown’s power.",
          "branch_id": 13,
          "effects": { "energy": -20, "strength": 5, "health": -5, "gold": 0 }
        }
      ]
    },
    {
      "branch_id": 11,
      "text": "You draw your weapon as the air cracks with magic. The spirit moves like smoke and lightning, striking faster than you can see. Each blow drains your life, but your defiance only fuels your strength. The crown burns hotter with every strike.",
      "responses": [
        {
          "response": "Strike a final blow and banish him.",
          "branch_id": 14,
          "effects": { "energy": -10, "strength": 15, "health": -10, "gold": 50 }
        },
        {
          "response": "Fall back and defend, conserving strength.",
          "branch_id": 15,
          "effects": { "energy": -5, "strength": 5, "health": -5, "gold": 0 }
        }
      ]
    },
    {
      "branch_id": 12,
      "text": "You bow, lowering your head before the ancient monarch. The ghost studies you with unreadable eyes. *You would kneel so easily? Then perhaps you’ll make a fine vessel.* Shadows slither up your arms — cold, binding, possessive.",
      "responses": [
        {
          "response": "Resist the possession.",
          "branch_id": 16,
          "effects": { "energy": -10, "strength": 5, "health": -5, "gold": 0 }
        },
        {
          "response": "Let him take control and see what power comes.",
          "branch_id": 17,
          "effects": { "energy": -5, "strength": 10, "health": -10, "gold": 0 }
        }
      ]
    },
    {
      "branch_id": 13,
      "text": "You extend your will through the crown, whispering the old words you don’t remember learning. The spirit gasps — a sound of rage and disbelief. The chamber twists, symbols flaring on the walls. You’re trying to imprison him again, and he knows it.",
      "responses": [
        {
          "response": "Push harder — complete the binding.",
          "branch_id": 18,
          "effects": { "energy": -20, "strength": 5, "health": -15, "gold": 0 }
        },
        {
          "response": "Release him and beg for mercy.",
          "branch_id": 19,
          "effects": { "energy": -5, "strength": 0, "health": 5, "gold": 0 }
        }
      ]
    },
    {
      "branch_id": 14,
      "text": "Your blade pierces the spirit’s heart — a flash of pure light fills the room. The crown screams as energy rushes into you. The Wraith King’s essence collapses into a glowing gem at your feet. You can feel it thrumming with raw, ancient power.",
      "responses": [
        {
          "response": "Take the gem and fuse it into the crown.",
          "branch_id": 20,
          "effects": { "energy": -10, "strength": 15, "health": -10, "gold": 100 }
        }
      ]
    },
    {
      "branch_id": 15,
      "text": "You guard yourself, blocking each spectral strike until the spirit falters. The crown whispers guidance, and you move as if possessed by memory. When the battle ends, the ghost drifts back to the throne, silent but defeated.",
      "responses": [
        {
          "response": "Show mercy and listen to what he has to say.",
          "branch_id": 19,
          "effects": { "energy": -5, "strength": 5, "health": 0, "gold": 0 }
        }
      ]
    },
    {
      "branch_id": 16,
      "text": "You grit your teeth, pushing the invading force back with sheer willpower. The crown glows violently, torn between two masters. A blast of energy throws you across the chamber, and when you rise — the spirit looks weakened, fading.",
      "responses": [
        {
          "response": "Strike him down while he’s weak.",
          "branch_id": 14,
          "effects": { "energy": -10, "strength": 10, "health": -5, "gold": 50 }
        }
      ]
    },
    {
      "branch_id": 17,
      "text": "You surrender. Cold darkness floods your mind as your vision fades. When you wake, the world is sharper, quieter, more obedient. The Wraith King now speaks through you, and your voice carries his. You are his vessel — and his weapon.",
      "responses": [
        {
          "response": "Embrace your new role as ruler of shadow.",
          "branch_id": 20,
          "effects": { "energy": -10, "strength": 15, "health": -5, "gold": 0 }
        }
      ]
    },
    {
      "branch_id": 18,
      "text": "The spell completes — the Wraith King screams, his form shattering into motes of ash. The crown dims, finally silent. But your body trembles under the power you just claimed. You’ve caged a god — and the cage is your soul.",
      "responses": [
        {
          "response": "Try to stabilize the power within.",
          "branch_id": 20,
          "effects": { "energy": -15, "strength": 10, "health": -15, "gold": 0 }
        }
      ]
    },
    {
      "branch_id": 19,
      "text": "You release the binding and lower your weapon. The ghost nods, almost… approvingly. *Mercy was rare, even in my time,* he murmurs. *Perhaps you are the ruler I could not be.* The crown’s hum softens — for once, it feels almost human.",
      "responses": [
        {
          "response": "Accept his blessing and prepare to leave the ruins.",
          "branch_id": 20,
          "effects": { "energy": 10, "strength": 5, "health": 10, "gold": 50 }
        }
      ]
    },
    {
      "branch_id": 20,
      "text": "As the dust settles, the ruins fall silent. The crown’s hum changes — less demanding, more... aware. Whether you claimed the spirit’s power, mercy, or corruption, you have altered the crown’s destiny. In the distance, the sound of footsteps echoes — another seeker approaches. The story isn’t done; the crown’s legacy continues through you.",
      "responses": []
    }
  ]
}
