{
  "branchImage": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcS2vWcEjP4wO8y8wTzFzMl4kPq3y3U_oPZc0A&s",
  "nextBranchFile": "cursed_crown/cursed_crown_08.json",
  "branches": [
    {
      "branch_id": 1,
      "text": "You step into the vast hall, and the whispers crescendo into a roar. The spectral kings kneel, their eyes hollow but attentive. In the center, a towering Wraith King appears, his crown blazing with dark energy. The cursed crown on your head thrums, urging you toward domination.",
      "responses": [
        {
          "response": "Challenge the Wraith King head-on",
          "branch_id": 2,
          "effects": { "energy": -10, "strength": 10, "health": -10, "gold": 0 }
        },
        {
          "response": "Attempt to parley with the Wraith King",
          "branch_id": 3,
          "effects": { "energy": -5, "strength": 2, "health": -2, "gold": 0 }
        },
        {
          "response": "Use the bound spirits to attack first",
          "branch_id": 4,
          "effects": { "energy": -8, "strength": 8, "health": -5, "gold": 0 }
        }
      ]
    },
    {
      "branch_id": 2,
      "text": "Steel clashes with ghostly claws. Pain sears through your body as the Wraith King strikes with supernatural force. You manage to land a blow, but the battle is far from over. Shadows writhe along the walls, echoing your every move.",
      "responses": [
        {
          "response": "Focus all your strength for a final strike",
          "branch_id": 5,
          "effects": { "energy": -15, "strength": 12, "health": -15, "gold": 0 }
        },
        {
          "response": "Dodge and wait for an opening",
          "branch_id": 6,
          "effects": { "energy": -8, "strength": 4, "health": -5, "gold": 0 }
        }
      ]
    },
    {
      "branch_id": 3,
      "text": "You speak calmly, offering the crown’s power as a shared rule. The Wraith King’s hollow eyes flicker with curiosity. 'Few dare to negotiate,' he whispers. 'Perhaps you understand the curse better than I thought.'",
      "responses": [
        {
          "response": "Propose a truce to share the crown’s power",
          "branch_id": 7,
          "effects": { "energy": -5, "strength": 5, "health": -3, "gold": 0 }
        },
        {
          "response": "Feign weakness and strike unexpectedly",
          "branch_id": 2,
          "effects": { "energy": -7, "strength": 8, "health": -5, "gold": 0 }
        }
      ]
    },
    {
      "branch_id": 4,
      "text": "The spirits surge forward, slamming into the Wraith King. He laughs, a hollow echo, and waves a spectral hand. Some spirits dissipate instantly, their energy feeding the crown’s dark glow. The rest turn back to you, shaken but obedient.",
      "responses": [
        {
          "response": "Lead the spirits in another coordinated strike",
          "branch_id": 5,
          "effects": { "energy": -12, "strength": 10, "health": -7, "gold": 0 }
        },
        {
          "response": "Call off the spirits and confront the Wraith King yourself",
          "branch_id": 2,
          "effects": { "energy": -8, "strength": 6, "health": -5, "gold": 0 }
        }
      ]
    },
    {
      "branch_id": 5,
      "text": "With a final surge of effort, you strike the Wraith King directly. A scream echoes through the hall as shadows collapse and the crown pulses violently. You feel the curse’s pull, stronger than ever, but the King lies defeated. Victory is yours — for now.",
      "responses": [
        {
          "response": "Remove the Wraith King’s crown and claim it fully",
          "branch_id": 8,
          "effects": { "energy": -10, "strength": 5, "health": -5, "gold": 20 }
        },
        {
          "response": "Leave the crown and escape the ruins",
          "branch_id": 9,
          "effects": { "energy": -5, "strength": 2, "health": -2, "gold": 0 }
        }
      ]
    },
    {
      "branch_id": 6,
      "text": "You evade the Wraith King’s strikes, waiting for an opening. The crown thrums violently, warning of imminent danger. Sweat drips from your brow as the shadows writhe closer, threatening to consume you if you hesitate too long.",
      "responses": [
        {
          "response": "Charge at the Wraith King with all your remaining strength",
          "branch_id": 5,
          "effects": { "energy": -12, "strength": 8, "health": -10, "gold": 0 }
        },
        {
          "response": "Step back and try to retreat from the hall",
          "branch_id": 9,
          "effects": { "energy": -6, "strength": 0, "health": -5, "gold": 0 }
        }
      ]
    },
    {
      "branch_id": 7,
      "text": "The Wraith King nods slowly. 'Perhaps we may share the burden,' he says. A spectral aura envelops you both, merging your will with the crown’s dark power. You feel stronger, wiser, but the whispers will never leave you. Balance and danger walk hand in hand now.",
      "responses": [
        {
          "response": "Accept this new power and lead together",
          "branch_id": 10,
          "effects": { "energy": -5, "strength": 10, "health": -3, "gold": 0 }
        },
        {
          "response": "Break the truce and strike anyway",
          "branch_id": 2,
          "effects": { "energy": -8, "strength": 12, "health": -5, "gold": 0 }
        }
      ]
    },
    {
      "branch_id": 8,
      "text": "You claim the Wraith King’s crown. Power surges through you, intoxicating yet suffocating. The spirits bow but shiver in fear. The curse now binds you completely, a price for ultimate dominance. The hall grows silent, save for your heartbeat and the crown’s whispers.",
      "responses": []
    },
    {
      "branch_id": 9,
      "text": "You leave the crown and flee the ruins, scarred but alive. Outside, sunlight warms your skin, and the air is fresh. Yet the whispers linger faintly in your mind — a reminder that power once tasted is never fully forgotten.",
      "responses": []
    },
    {
      "branch_id": 10,
      "text": "Sharing the crown’s power with the Wraith King, you become a legend whispered in both fear and awe. The ruins remain, a monument to ambition and caution. Balance is maintained, but the crown’s pull remains ever-present, a constant test of will and strength.",
      "responses": []
    }
  ]
}
