{
  "branchImage": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcVjPq1yGfXk5Z9dX-LKjH9Pq0rH7qN8FqkLJg&s",
  "nextBranchFile": "",
  "branches": [
    {
      "branch_id": 1,
      "text": "The crown sits heavy on your head, or perhaps it is your own ambition that weighs most. The ruins are silent. Outside, sunlight streams through broken arches, illuminating the path ahead. The journey has tested every ounce of your strength, will, and courage.",
      "responses": [
        {
          "response": "Accept the crown’s power fully",
          "branch_id": 2,
          "effects": { "energy": -10, "strength": 10, "health": -10, "gold": 50 }
        },
        {
          "response": "Reject the crown and leave it behind",
          "branch_id": 3,
          "effects": { "energy": -5, "strength": 5, "health": -5, "gold": 0 }
        },
        {
          "response": "Take a fragment of the crown’s power",
          "branch_id": 4,
          "effects": { "energy": -5, "strength": 7, "health": -2, "gold": 20 }
        }
      ]
    },
    {
      "branch_id": 2,
      "text": "Power surges through you. Shadows bow and whispers fill your mind, but you stand victorious. The crown’s curse binds you forever, but with it comes the ability to shape kingdoms. You are feared, respected, and alone — a ruler of shadows and might. The tale of the cursed crown ends here… for now.",
      "responses": []
    },
    {
      "branch_id": 3,
      "text": "You walk away from the crown. The wind carries away the whispers, and sunlight warms your skin. You feel lighter, freer, and wiser. The crown remains in the ruins, a temptation for another adventurer. Your journey ends, not with ultimate power, but with peace and survival.",
      "responses": []
    },
    {
      "branch_id": 4,
      "text": "You pocket a fragment of the crown’s power. It hums faintly, giving you strength without total domination. You leave the ruins with new wisdom and caution. The whispers linger, a reminder that power has its cost. Life continues, and the story is yours to write, but you are forever touched by the crown.",
      "responses": []
    }
  ]
}
