{
  "branches": [
    {
      "branch_id": 1,
      "text": "You reach the heart of the cavern. The ceiling opens to the sky above, and a shimmering pool of light sits at the center. It radiates immense energy, promising power or peril.",
      "responses": [
        {
          "response": "Step into the pool and absorb its energy",
          "branch_id": 2,
          "effects": {
            "health": +30,
            "magic": +50,
            "strength": +20
          }
        },
        {
          "response": "Take a vial of the pool's energy cautiously",
          "branch_id": 3,
          "effects": {
            "magic": +25,
            "health": +10
          }
        },
        {
          "response": "Leave the pool and exit the cavern",
          "branch_id": 4
        }
      ]
    },
    {
      "branch_id": 2,
      "text": "The energy surges through you. You feel invincible, every muscle and magical fiber alive. The cavern hums, approving your bravery. This power will serve you well in all adventures ahead.",
      "responses": [
        {
          "response": "Return to the forest and continue your journey",
          "branch_id": 5
        }
      ]
    },
    {
      "branch_id": 3,
      "text": "You carefully fill a vial with the pool's energy. It glows brightly in your hand. Though you don’t feel immediate change, you know this will grant incredible magical boosts when needed.",
      "responses": [
        {
          "response": "Return to the forest and continue your journey",
          "branch_id": 5
        }
      ]
    },
    {
      "branch_id": 4,
      "text": "You resist the temptation of the pool. Leaving the cavern, you feel a sense of calm and wisdom, knowing some power is best left untouched. The forest greets you with morning light.",
      "responses": [
        {
          "response": "Continue your journey",
          "branch_id": 5
        }
      ]
    },
    {
      "branch_id": 5,
      "text": "Stepping out of the cavern, the forest stretches before you. Birds sing, a gentle breeze brushes your face, and you feel the weight of your trials and treasures. You survived the lich, navigated the magical tunnels, and emerged stronger, wiser, and richer than before.",
      "responses": [
        {
          "response": "Reflect on your adventure and plan your next quest",
          "branch_id": 6
        }
      ]
    },
    {
      "branch_id": 6,
      "text": "Your adventure concludes here, for now. With your health, strength, magic, and gold intact (or not), the stories of the magical cavern, the lich, and the spectral guardians will live on — until your next journey calls.",
      "responses": []
    }
  ]
}
