{
  "branchImage": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcU9Wb2Fq9K1o5X6D-3aSgTz5LQbqF7aPqjKJg&s",
  "nextBranchFile": "cursed_crown/cursed_crown_10.json",
  "branches": [
    {
      "branch_id": 1,
      "text": "The ruins fall silent. Outside, the wind carries faint echoes of the crown’s whispers. How you emerged has shaped not only your fate, but the fate of all who might seek its power.",
      "responses": [
        {
          "response": "Reflect on the journey and its cost",
          "branch_id": 2,
          "effects": { "energy": -2, "strength": 0, "health": 5, "gold": 0 }
        },
        {
          "response": "Plan to explore another ruin hinted at in the whispers",
          "branch_id": 3,
          "effects": { "energy": -5, "strength": 2, "health": 0, "gold": 0 }
        }
      ]
    },
    {
      "branch_id": 2,
      "text": "You take a moment to assess your body and mind. The bruises ache, your energy is low, but the knowledge and power you gained linger. Memories of allies lost and spirits bound weigh on your conscience. The crown, broken or tamed, has left its mark forever.",
      "responses": [
        {
          "response": "Return to the nearest town and rest",
          "branch_id": 4,
          "effects": { "energy": 10, "strength": 0, "health": 10, "gold": 0 }
        },
        {
          "response": "Venture onward, carrying the lessons learned",
          "branch_id": 5,
          "effects": { "energy": -5, "strength": 5, "health": -2, "gold": 0 }
        }
      ]
    },
    {
      "branch_id": 3,
      "text": "The whispers hint at another ruin, older and more dangerous. You feel a thrill at the prospect — treasure, power, or secrets lost to time. Every adventurer must make choices, and the crown has taught you that patience and wisdom often matter more than raw power.",
      "responses": [
        {
          "response": "Prepare supplies and journey to the new ruin",
          "branch_id": 6,
          "effects": { "energy": -10, "strength": 2, "health": 0, "gold": -20 }
        },
        {
          "response": "Decide to rest and reflect first",
          "branch_id": 4,
          "effects": { "energy": 5, "strength": 0, "health": 5, "gold": 0 }
        }
      ]
    },
    {
      "branch_id": 4,
      "text": "You rest in a quiet glade near the ruins. The sunlight warms your skin, and the air feels safe. You meditate on the lessons of power, greed, and courage. The crown’s whispers are faint now — a reminder of what was, and what could have been.",
      "responses": []
    },
    {
      "branch_id": 5,
      "text": "You march forward, determined. Your body protests, but your mind is sharp. The echoes of the crown whisper of future challenges, allies and enemies alike. The road ahead is uncertain, but your courage has been tested — and proven.",
      "responses": []
    },
    {
      "branch_id": 6,
      "text": "You stock up on supplies, adjust your armor, and study the whispers from the fragments of the crown. Tomorrow, a new adventure begins. Whether to seek glory, knowledge, or redemption, the choice is yours. The crown’s shadow may follow, but you are prepared to face it.",
      "responses": []
    }
  ]
}
