{
  "branchImage": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQ2zKjA4sJxMRzGJH2tflTzGg8E5Bv2w8MZkg&s",
  "nextBranchFile": "cursedcrown/cursed_crown_04.json",
  "branches": [
    {
      "branch_id": 1,
      "text": "The crown’s hum grows louder as you travel through the ancient ruins. Every step feels heavier — not from fatigue, but from something watching you. The stones under your boots whisper forgotten oaths. You can feel power swelling inside your veins, and it’s not all your own.",
      "responses": [
        {
          "response": "Search the ruins for clues about the crown’s origin.",
          "branch_id": 2,
          "effects": { "energy": -10, "strength": 5, "gold": 0, "health": 0 }
        },
        {
          "response": "Ignore the whispers and press onward.",
          "branch_id": 3,
          "effects": { "energy": -5, "health": -5, "strength": 0, "gold": 5 }
        }
      ]
    },
    {
      "branch_id": 2,
      "text": "You uncover carvings showing a king kneeling before a shadow crowned with flame. The inscription reads: *Power demands payment.* Your head throbs as the crown hums in response. Something deep within you shifts — an unseen force taking interest.",
      "responses": [
        {
          "response": "Touch the carvings and channel the crown’s energy.",
          "branch_id": 4,
          "effects": { "energy": -15, "strength": 10, "health": -10, "gold": 0 }
        },
        {
          "response": "Step back and record the markings for later.",
          "branch_id": 5,
          "effects": { "energy": -5, "strength": 0, "health": 5, "gold": 0 }
        }
      ]
    },
    {
      "branch_id": 3,
      "text": "The path opens into a grand courtyard overrun by vines and forgotten statues. You spot a chest, half-buried under rubble. Its lock glows faintly — magic, or maybe a trap. The crown whispers, *We deserve what’s inside.*",
      "responses": [
        {
          "response": "Open the chest with brute force.",
          "branch_id": 6,
          "effects": { "energy": -10, "strength": 5, "health": -5, "gold": 50 }
        },
        {
          "response": "Examine it carefully before touching.",
          "branch_id": 7,
          "effects": { "energy": -5, "strength": 0, "health": 0, "gold": 10 }
        }
      ]
    },
    {
      "branch_id": 4,
      "text": "The carvings flare with golden fire. Power floods your body — your muscles tighten, and for a brief moment, you feel invincible. Then the pain hits. Blood trickles from your nose, but the crown hums, pleased. You’ve fed it, and it rewards you with strength beyond mortal limits.",
      "responses": [
        {
          "response": "Harness this new strength and push deeper into the ruins.",
          "branch_id": 8,
          "effects": { "energy": -10, "strength": 10, "health": -5, "gold": 0 }
        }
      ]
    },
    {
      "branch_id": 5,
      "text": "You sketch the carvings and note the symbols — a good scholar’s habit. As you finish, a faint wind carries a voice: *Knowledge is also a kind of power.* A hidden compartment opens beneath the wall, revealing a small pouch of gold coins and a crystal vial of restorative tonic.",
      "responses": [
        {
          "response": "Take the rewards and continue onward.",
          "branch_id": 8,
          "effects": { "energy": 10, "strength": 0, "health": 10, "gold": 30 }
        }
      ]
    },
    {
      "branch_id": 6,
      "text": "You smash the lock open — a burst of crimson light erupts! The chest explodes, and dark mist engulfs you. The crown absorbs it eagerly, leaving you gasping. When the smoke clears, gold spills at your feet, but your veins burn like molten metal.",
      "responses": [
        {
          "response": "Gather the gold and move on, ignoring the pain.",
          "branch_id": 9,
          "effects": { "energy": -10, "strength": 5, "health": -10, "gold": 80 }
        }
      ]
    },
    {
      "branch_id": 7,
      "text": "You carefully brush the dust away, revealing runes meant to ward off thieves. Using the crown’s subtle hum as a guide, you disable the enchantment. Inside, you find aged coins, a silver dagger, and a note reading: *For the next fool who dares.*",
      "responses": [
        {
          "response": "Take the dagger and continue with caution.",
          "branch_id": 9,
          "effects": { "energy": -5, "strength": 5, "health": 0, "gold": 40 }
        }
      ]
    },
    {
      "branch_id": 8,
      "text": "The ruins lead into a hall of mirrors — endless reflections, each showing you wearing the crown differently: king, tyrant, corpse. The whispers grow louder: *Choose who you wish to be.*",
      "responses": [
        {
          "response": "Reach for the reflection where you are crowned in light.",
          "branch_id": 10,
          "effects": { "energy": -5, "strength": 5, "health": 10, "gold": 0 }
        },
        {
          "response": "Touch the reflection where you rule through fear.",
          "branch_id": 10,
          "effects": { "energy": -5, "strength": 10, "health": -10, "gold": 0 }
        }
      ]
    },
    {
      "branch_id": 9,
      "text": "The deeper you go, the louder the heartbeat of the crown becomes. A door of obsidian stands before you, carved with symbols of binding. A pulse of energy runs through your chest — it wants you to open it.",
      "responses": [
        {
          "response": "Push open the door and face what lies beyond.",
          "branch_id": 10,
          "effects": { "energy": -10, "strength": 10, "health": -5, "gold": 0 }
        },
        {
          "response": "Step back and rest before proceeding.",
          "branch_id": 10,
          "effects": { "energy": 10, "strength": 0, "health": 10, "gold": 0 }
        }
      ]
    },
    {
      "branch_id": 10,
      "text": "The chamber beyond glows with a strange twilight. Floating in the air is a throne of black glass — and upon it, a faint outline of a crowned spirit. It looks at you with eyes like eclipses. The crown hums violently. *You’ve come far,* the spirit says. *Now prove you are its master — or its next host.*",
      "responses": []
    }
  ]
}
